ATsupportum/src/Catalogs/Договоры_ат/Договоры_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры_ат</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты_ат</owners>
  <attributes>
    <name>Автопролонгация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.ВидыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатыПоДоговорам_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасторжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПостоплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитСуммыПриПостоплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВнутреннее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноВнешнееСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуОборудования_ат</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>CatalogRef.Проекты_ат</types>
      <types>DocumentRef.ЗаявкаНаАрендуПП_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДанныхДляОпределенияТарифногоПлана</name>
    <type>
      <types>EnumRef.ПериодДанныхДляОпределенияТарифногоПлана_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРеализаций</name>
    <type>
      <types>EnumRef.ПериодичностиРеализаций_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСчетов</name>
    <type>
      <types>EnumRef.ПериодичностиСчетов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасторжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодДоговора</name>
    <type>
      <types>EnumRef.РодыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодписанияРеализации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаТарифногоПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/InformationRegisters/ДанныеДоговоров_ат/ДанныеДоговоров_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеДоговоров_ат</name>
  <comment>!!!!!HOTFIX + переименовать в ИсториюДанных..</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>РодительскийДоговор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/СпецификацияДоговоров_Обслуживание_ат/СпецификацияДоговоров_Обслуживание_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацияДоговоров_Обслуживание_ат</name>
  <resources>
    <name>ВключаетИТС</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНаПриемкуЗаявок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/Documents/СчетНаОплату_ат/СчетНаОплату_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату_ат</name>
  <basedOn>Document.Заявка_ат</basedOn>
  <basedOn>Document.Согласование_ат</basedOn>
  <registerRecords>AccountingRegister.Клиентский_ат</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийНомер</name>
    <type>
      <types>DefinedType.ТипВнешнегоНомера_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплатыПланируемая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДокументОснование</name>
    <type>
      <types>DocumentRef.Согласование_ат</types>
      <types>DocumentRef.ФиксацияРабот_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьСОперативногоБаланса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КомментарийВнутренний</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифрыНомера</name>
    <comment>!!!rename</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КосвенныеСвязиЗаданий</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Задание</name>
      <type>
        <types>DocumentRef.Задание_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Основания</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.Согласование_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реализации</name>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ATsupportum/src/Catalogs/Договоры_ат/ObjectModule.bsl
Перем СтруктураНовогоНомера Экспорт;


#Область  ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если Ссылка.Пустая() Тогда
	//	
	//	Если НЕ ЗначениеЗаполнено(НомерДоговора) Тогда
	//		
	//		Если ЗначениеЗаполнено(Родитель) Тогда
	//			
	//			НомерДоговора = Справочники.Договоры_ат.ПолучитьНомерПодчиненногоДоговора(Родитель);
	//			
	//		Иначе
	//			
	//			НомерИПостфикс = Нумераторы_ат.ПолучитьНомерОбъекта(ЭтотОбъект, ДатаДоговора,,, Ложь);
	//			
	//			Если Тип(НомерИПостфикс) = ТипЗнч("Структура") И НомерИПостфикс.Свойство("Номер") Тогда
	//				
	//				НомерДоговора  = НомерИПостфикс.Номер;
	//				
	//			Иначе
	//				
	//				Сообщить("Ошибка определение нового номера договора!", СтатусСообщения.Внимание);
	//				Отказ = Истина;
	//				Возврат;
	//				
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Справочники.Договоры_ат.ЗаполнитьНаименованиеДоговора(ЭтотОбъект);
	//
	//Если Ссылка.Пустая() Тогда
	//	
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Наименование")); // У нового договора генерируется при записи
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Родитель.Родитель.Пустая() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя сделать Дополнительное Соглашение к Дополнительному Соглашению (только непосредственно к основному Договору)!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ПроверитьКлючевыеРеквизиты(Отказ);
	
	Если СтруктураНовогоНомера <> Неопределено И Родитель.Пустая() Тогда
		
		СтруктураНомера = Нумераторы_ат.ЗаписатьНомерОбъекта(СтруктураНовогоНомера, Истина);
		Если ТипЗнч(СтруктураНомера) <> Тип("Структура") Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка сохранения номера договора!";
			Сообщение.Сообщить();
			Отказ = Истина;
			
		ИначеЕсли НомерДоговора <> СтруктураНомера.Номер Тогда
			
			НомерДоговора = СтруктураНомера.Номер;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При записи договора обнаружна коллизия номеров! Присвоен новый номер (и пересозданы наименования) - №" + НомерДоговора;
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		СтруктураНовогоНомера = Неопределено;
		
	КонецЕсли;
	
	Справочники.Договоры_ат.ЗаполнитьНаименованияДоговора(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Удаляем данные при смене ТипаДоговора
	Если Ссылка.ВидДоговора.ТипДоговора <> ВидДоговора.ТипДоговора Тогда
		
		ИмяРегистра = Справочники.Договоры_ат.ПолучитьИмяРегистраСпецификацииДляТипаДоговора(Ссылка.ВидДоговора.ТипДоговора);
		Если ИмяРегистра <> Неопределено Тогда
			
			Попытка
				
				НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Договор.Установить(Ссылка);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();
				
			Исключение
				
				Отказ = Истина;
				Сообщить(ОписаниеОшибки());
				Возврат;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Удаляем данные при смене Родителя (Основного договора)
	Если Ссылка.Родитель <> Родитель Тогда
		
		НаборЗаписей = РегистрыСведений.ДанныеДоговоров_ат.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РодительскийДоговор.Установить(?(Ссылка.Родитель.Пустая(), Ссылка, Ссылка.Родитель));
		НаборЗаписей.Прочитать();
		
		ЗаписьДоговора = ЗаписьДанныхДоговора(НаборЗаписей);
		
		Если ЗаписьДоговора <> Неопределено Тогда
			
			НаборЗаписей.Удалить(ЗаписьДоговора);
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	//
	
	РодительскийДоговор = ?(Родитель.Пустая(), Ссылка, Родитель);
	
	НаборЗаписей = РегистрыСведений.ДанныеДоговоров_ат.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РодительскийДоговор.Установить(РодительскийДоговор);
	НаборЗаписей.Прочитать();
	
	ЗаписьДоговора = ЗаписьДанныхДоговора(НаборЗаписей);
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		
		Если ЗаписьДоговора = Неопределено Тогда
			ЗаписьДоговора = НаборЗаписей.Добавить();
		КонецЕсли;
		
		ЗаписьДоговора.Договор 				= Ссылка;
		ЗаписьДоговора.Период 				= ДатаНачала;
		ЗаписьДоговора.ДатаОкончания 		= ДатаОкончания(); //!!!TODO - если допик не с автопролонгацией, то надо делать запись с предыдущим
		ЗаписьДоговора.РодительскийДоговор 	= РодительскийДоговор; // актуальным договором (вычислять) на дату следующую за ДатаОкончания
		ЗаписьДоговора.ПометкаУдаления 		= ПометкаУдаления; //!!! зачем запись? почему не просто удалять?
		
	ИначеЕсли ЗаписьДоговора <> Неопределено Тогда
		
		НаборЗаписей.Удалить(ЗаписьДоговора);
		
	КонецЕсли;
	
	Попытка
		
		НаборЗаписей.Записать();
		
	Исключение
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецПопытки;
	
	//
	
	БазаДанных = Константы.БухгалтерияДляСинхронизации_ат.Получить();
	
	Если БазаДанных.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСинхронизации = СинхронизацияСБП_ат.СинхронизироватьДоговорСКонтрагентом(Ссылка, БазаДанных,, Ложь);
	
	Если РезультатСинхронизации.Ошибки.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		Для Каждого Ошибка Из РезультатСинхронизации.Ошибки Цикл
			Сообщить(Ошибка);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область  СлужебныеПроцедурыИФункции

Процедура ПроверитьКлючевыеРеквизиты(Отказ)
	
	Если НЕ Родитель.Пустая() Тогда
		
		Если Родитель.Организация <> Организация Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Организация в доп. соглашении не может отличаться от указанной в основном догворе!";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Родитель.Владелец <> Владелец Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Контрагент в доп. соглашении не может отличаться от указанного в основном догворе!";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Родитель.ВидДоговора <> ВидДоговора Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Вид договора в доп. соглашении не может отличаться от указанного в основном догворе!";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Родитель.РодДоговора <> РодДоговора Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Вид договора контрагента в доп. соглашении не может отличаться от указанного в основном догворе!";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если Отказ ИЛИ ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;

	Если Организация <> Ссылка.Организация
		ИЛИ Владелец <> Ссылка.Владелец
		ИЛИ ВидДоговора <> Ссылка.ВидДоговора
		ИЛИ РодДоговора <> Ссылка.РодДоговора
		Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Договоры_ат.Ссылка) КАК Количество,
			|	ИСТИНА КАК Договоры,
			|	ЛОЖЬ КАК Счета,
			|	ЛОЖЬ КАК Реализации,
			|	ЛОЖЬ КАК Спецификации
			|ИЗ
			|	Справочник.Договоры_ат КАК Договоры_ат
			|ГДЕ
			|	Договоры_ат.Родитель = &Договор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетНаОплату_ат.Ссылка),
			|	ЛОЖЬ,
			|	ИСТИНА,
			|	ЛОЖЬ,
			|	ЛОЖЬ
			|ИЗ
			|	Документ.СчетНаОплату_ат КАК СчетНаОплату_ат
			|ГДЕ
			|	СчетНаОплату_ат.Договор = &Договор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Реализация_ат.Ссылка),
			|	ЛОЖЬ,
			|	ЛОЖЬ,
			|	ИСТИНА,
			|	ЛОЖЬ
			|ИЗ
			|	Документ.Реализация_ат КАК Реализация_ат
			|ГДЕ
			|	Реализация_ат.Договор = &Договор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СпецификацияДоговоров_Обслуживание_ат.Договор.Ссылка),
			|	ЛОЖЬ,
			|	ЛОЖЬ,
			|	ЛОЖЬ,
			|	ИСТИНА
			|ИЗ
			|	РегистрСведений.СпецификацияДоговоров_Обслуживание_ат КАК СпецификацияДоговоров_Обслуживание_ат
			|ГДЕ
			|	СпецификацияДоговоров_Обслуживание_ат.ВключаетИТС.Ссылка = &Договор";
		
		Запрос.УстановитьПараметр("Договор", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПрисоединяемыйТекстПричины = "";
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Договоры И Выборка.Количество > 0 Тогда
				
				ПрисоединяемыйТекстПричины = ПрисоединяемыйТекстПричины + "," +
					?(Выборка.Количество = 1, " Доп. соглашение", " Доп. соглашения");
				
			ИначеЕсли Выборка.Счета И Выборка.Количество > 0 Тогда
				
				ПрисоединяемыйТекстПричины = ПрисоединяемыйТекстПричины + "," +
					?(Выборка.Количество = 1, " Счёт созданный по договору", " Счета созданные по договору"); 
				
			ИначеЕсли Выборка.Реализации И Выборка.Количество > 0 Тогда
				
				ПрисоединяемыйТекстПричины = ПрисоединяемыйТекстПричины + "," +
					?(Выборка.Количество = 1, " Реализация созданная по договору", " Реализации созданные по договору");
				
			ИначеЕсли Выборка.Спецификации И Выборка.Количество > 0 Тогда		
				
				ПрисоединяемыйТекстПричины = ПрисоединяемыйТекстПричины + "," +
					?(Выборка.Количество = 1, " ссылка на Договор в спецификации Договора", " ссылки на Договор в спецификации Договоров");
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПрисоединяемыйТекстПричины) Тогда
			
			Отказ = Истина;
			
			Сообщить("Изменение ключевых реквизитов Договора не допустимо т.к. есть" +
				Прав(ПрисоединяемыйТекстПричины, СтрДлина(ПрисоединяемыйТекстПричины) - 1) + ".");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция   ДатаОкончания()
	
	ДатаОкончания = Дата(1, 1, 1);
	
	Если ЗначениеЗаполнено(ДатаРасторжения) И ЗначениеЗаполнено(СрокДоговора) Тогда
		
		Если Автопролонгация ИЛИ ДатаРасторжения <= СрокДоговора Тогда
			ДатаОкончания = ДатаРасторжения;
		Иначе
			ДатаОкончания = СрокДоговора;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДатаРасторжения) Тогда
		
		ДатаОкончания = ДатаРасторжения;
		
	ИначеЕсли НЕ Автопролонгация Тогда 
		
		ДатаОкончания = СрокДоговора;
		
	КонецЕсли;
	
	Возврат ДатаОкончания;
	
КонецФункции 

Функция   ЗаписьДанныхДоговора(НаборЗаписей)
	
	ЗаписьДоговора = Неопределено;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Если Запись.Договор = Ссылка Тогда
			
			ЗаписьДоговора = Запись;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗаписьДоговора;
	
КонецФункции

#КонецОбласти


СтруктураНовогоНомера = Неопределено;
